'''
Курс: Основы языка Python
Урок 4. Знакомство с Python
Домашеннее задание (Кузнецов С.Н.)
====================================================================
3)	Для чисел в пределах от 20 до 240 найти числа, кратные 20 или 21.
Необходимо решить задание в одну строку.
Подсказка: использовать функцию range() и генератор.
====================================================================
'''

# Вариант 1
my_list = [x for x in range(20, 240, 20)] + [x for x in range(21, 240, 21)]
my_list.sort()
print('Вариант 1\n', my_list)

# Вариант 2 (более "правильный")
my_list = [x for x in range(20, 240) if x % 20 == 0 or x % 21 == 0]
print('Вариант 2\n', my_list)






