'''
Курс: Основы языка Python
Урок 5. Знакомство с Python
Домашеннее задание (Кузнецов С.Н.)
====================================================================
2)	Создать текстовый файл (не программно), сохранить в нем несколько строк,
выполнить подсчет количества строк, количества слов в каждой строке.
====================================================================
'''

try:
    with open("home_work_05_02.txt", 'r', encoding='utf-8') as f_obj:
        content_list = f_obj.readlines()
except IOError:
    print("Произошла ошибка ввода-вывода!")

print('В файле', len(content_list), 'строк')
for my_str in content_list:
    print('{:30} ({} слов)' .format(my_str[:-1:], len(list(my_str.split()))))



