'''
Курс: Основы языка Python
Урок 2. Знакомство с Python
Домашеннее задание (Кузнецов С.Н.)
====================================================================
5)	Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

====================================================================
'''

# Блок создания и объявления переменных
my_list = [7, 5, 3, 3, 2]
print(my_list)
while True:
    char = input('Введите число (q для выхода):')
    if char == 'q' or char == 'Q':
        break
    num = int(char)
    for el in range(len(my_list)):
        if num >= my_list[el]:
            my_list.insert(el, num)
            break
    else:                       # вышли за границы списка, так и не найдя, куда вставить (предложено минимальное число)
        my_list.append(num)     # добавим в конец списка
    print(my_list)



