'''
Курс: Основы языка Python
Урок 1. Знакомство с Python
Домашеннее задание (Кузнецов С.Н.)
====================================================================
3)	Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn.
Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.
====================================================================
'''

while True:
    int_number = int(input('Введите целое положительное число от 0 до 9: '))
    if int_number >= 0 and int_number <= 9:
        break
#int_number = 7
amount_level = 3                # количество уровней в сумме
char_number = str(int_number)   # изменим тип числа на символ
str_number = ''                 # инициализируем строку числа
result_number = 0               # результат будем хранить здесь
for i in range(3):
    str_number += char_number
    result_number += int(str_number)

print(' При входных данных\nЧисло: {}\nКоличество уровней:{}\nСумма составит:{}'.format(int_number, amount_level, result_number))






